---
kind: type
id: T:Autodesk.Revit.DB.FamilyElementVisibilityType
source: html/729194e0-afdb-3043-f8da-c808dd257496.htm
---
# Autodesk.Revit.DB.FamilyElementVisibilityType

Indicates the Visibility type of generic forms.

## Syntax (C#)
```csharp
public enum FamilyElementVisibilityType
```

## Remarks
Use this enum to indicate the visibility type
of new forms.